In [1]:
import pandas as pd
import numpy as np

In [130]:
df = pd.read_csv("marks_final.csv", na_values = ["AB"])

In [132]:
df

,SNO.,ROLL NUMBER,Q1 (5),Q2 (5),Q3 (5),Q4 (5),Q5 (5),Q6 (5),Q7 (5),Q8 (5),Q9 (5),Q10 (5),Q11 (5),Q12 (5),Top 9 (out of 45),Out of 30
0,1,102003733,NaN,NaN,NaN,NaN,NaN,NaN,3.0,5.0,NaN,NaN,NaN,4.0,12,8.0
1,2,102203002,5,NaN,4.0,4.0,4.0,4.0,4.0,3.0,5.0,5.0,5.0,3.0,40,26.7
2,3,102203003,5,4.0,4.0,4.0,4.0,5.0,4.0,3.0,4.0,5.0,4.0,2.0,39,26.0
3,4,102203005,NaN,NaN,NaN,NaN,3.0,5.0,3.0,4.0,4.0,5.0,5.0,NaN,29,19.3
4,5,102203007,NaN,NaN,NaN,5.0,4.0,3.0,3.0,5.0,3.0,5.0,5.0,3.0,36,24.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1048,1049,102383062,5,4.0,NaN,5.0,3.0,4.0,NaN,3.0,4.0,5.0,4.0,5.0,39,26.0
1049,1050,102383067,5,2.0,3.0,4.0,3.0,5.0,2.0,5.0,NaN,5.0,5.0,5.0,40,26.7
1050,1051,102383071,5,3.0,5.0,4.0,3.0,3.0,4.0,5.0,4.0,5.0,5.0,5.0,42,28.0
1051,1052,102383081,5,3.0,3.0,NaN,4.0,NaN,NaN,5.0,NaN,5.0,5.0,3.0,33,22.0
1052,1053,102383083,NaN,NaN,3.0,NaN,5.0,NaN,4.0,NaN,NaN,4.0,5.0,3.0,24,16.0

In [134]:
avg1 = df['Top 9 (out of 45)']

In [136]:
np.mean(avg1)

38.14434947768281

In [138]:
df.head()

,SNO.,ROLL NUMBER,Q1 (5),Q2 (5),Q3 (5),Q4 (5),Q5 (5),Q6 (5),Q7 (5),Q8 (5),Q9 (5),Q10 (5),Q11 (5),Q12 (5),Top 9 (out of 45),Out of 30
0,1,102003733,NaN,NaN,NaN,NaN,NaN,NaN,3.0,5.0,NaN,NaN,NaN,4.0,12,8.0
1,2,102203002,5,NaN,4.0,4.0,4.0,4.0,4.0,3.0,5.0,5.0,5.0,3.0,40,26.7
2,3,102203003,5,4.0,4.0,4.0,4.0,5.0,4.0,3.0,4.0,5.0,4.0,2.0,39,26.0
3,4,102203005,NaN,NaN,NaN,NaN,3.0,5.0,3.0,4.0,4.0,5.0,5.0,NaN,29,19.3
4,5,102203007,NaN,NaN,NaN,5.0,4.0,3.0,3.0,5.0,3.0,5.0,5.0,3.0,36,24.0

In [142]:
notnull1 = df[('Q1 (5)').notnull()]

AttributeError: 'str' object has no attribute 'notnull'

In [37]:
mask = df['Q1 (5)'].notnull()
print(mask)

0       True
1       True
2       True
3       True
4       True
        ...
1048    True
1049    True
1050    True
1051    True
1052    True
Name: Q1 (5), Length: 1053, dtype: bool

In [108]:
avg2 = df['Out of 30']

In [110]:
np.mean(avg2)

25.430104463437797

In [116]:
gretter25 = df[df['Out of 30'] > 20 ]

In [118]:
gretter25

,SNO.,ROLL NUMBER,Q1 (5),Q2 (5),Q3 (5),Q4 (5),Q5 (5),Q6 (5),Q7 (5),Q8 (5),Q9 (5),Q10 (5),Q11 (5),Q12 (5),Top 9 (out of 45),Out of 30
1,2,102203002,5,AB,4,4,4,4,4,3,5,5,5,3,40,26.7
2,3,102203003,5,4,4,4,4,5,4,3,4,5,4,2,39,26.0
4,5,102203007,AB,AB,AB,5,4,3,3,5,3,5,5,3,36,24.0
5,6,102203008,3,3,5,4,1,4,3,4,5,4,5,5,39,26.0
6,7,102203012,AB,3,4,4,3,5,4,5,4,5,4,5,40,26.7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1047,1048,102383059,2,2,4,5,5,AB,5,4,5,5,5,2,40,26.7
1048,1049,102383062,5,4,AB,5,3,4,AB,3,4,5,4,5,39,26.0
1049,1050,102383067,5,2,3,4,3,5,2,5,AB,5,5,5,40,26.7
1050,1051,102383071,5,3,5,4,3,3,4,5,4,5,5,5,42,28.0
1051,1052,102383081,5,3,3,AB,4,AB,AB,5,AB,5,5,3,33,22.0

In [120]:
sham1 = df['Q1 (5)']

In [150]:
df.fillna(df.mean(numeric_only=True))

,SNO.,ROLL NUMBER,Q1 (5),Q2 (5),Q3 (5),Q4 (5),Q5 (5),Q6 (5),Q7 (5),Q8 (5),Q9 (5),Q10 (5),Q11 (5),Q12 (5),Top 9 (out of 45),Out of 30
0,1,102003733,NaN,3.452747,4.099678,4.322234,3.26824,4.165272,3.000000,5.000000,4.61945,4.755579,4.519744,4.000000,12,8.0
1,2,102203002,5,3.452747,4.000000,4.000000,4.00000,4.000000,4.000000,3.000000,5.00000,5.000000,5.000000,3.000000,40,26.7
2,3,102203003,5,4.000000,4.000000,4.000000,4.00000,5.000000,4.000000,3.000000,4.00000,5.000000,4.000000,2.000000,39,26.0
3,4,102203005,NaN,3.452747,4.099678,4.322234,3.00000,5.000000,3.000000,4.000000,4.00000,5.000000,5.000000,4.087234,29,19.3
4,5,102203007,NaN,3.452747,4.099678,5.000000,4.00000,3.000000,3.000000,5.000000,3.00000,5.000000,5.000000,3.000000,36,24.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1048,1049,102383062,5,4.000000,4.099678,5.000000,3.00000,4.000000,3.602371,3.000000,4.00000,5.000000,4.000000,5.000000,39,26.0
1049,1050,102383067,5,2.000000,3.000000,4.000000,3.00000,5.000000,2.000000,5.000000,4.61945,5.000000,5.000000,5.000000,40,26.7
1050,1051,102383071,5,3.000000,5.000000,4.000000,3.00000,3.000000,4.000000,5.000000,4.00000,5.000000,5.000000,5.000000,42,28.0
1051,1052,102383081,5,3.000000,3.000000,4.322234,4.00000,4.165272,3.602371,5.000000,4.61945,5.000000,5.000000,3.000000,33,22.0
1052,1053,102383083,NaN,3.452747,3.000000,4.322234,5.00000,4.165272,4.000000,4.003209,4.61945,4.000000,5.000000,3.000000,24,16.0